{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 64, 64, 3], "output_shape": null, "dtype": "float32", "name": "lambda_1", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0096\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}}, "class_name": "Lambda"}, {"config": {"use_bias": true, "kernel_size": [5, 5], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "padding": "valid", "activation": "linear", "name": "conv2d_1", "filters": 24, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [5, 5], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "padding": "valid", "activation": "linear", "name": "conv2d_2", "filters": 36, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [5, 5], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "padding": "valid", "activation": "linear", "name": "conv2d_3", "filters": 48, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "padding": "same", "activation": "linear", "name": "conv2d_4", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "activity_regularizer": null, "strides": [2, 2], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "padding": "valid", "activation": "linear", "name": "conv2d_5", "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "units": 80, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "units": 40, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "units": 16, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "units": 10, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.0010000000474974513}, "class_name": "L1L2"}, "bias_regularizer": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}